Revit 2027 API
NonContinuousRailStructure.GetNonContinuousRail Method
 Gets the Non-Continuous Rail object of specified index from the Rail Structure.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NonContinuousRailInfo GetNonContinuousRail(
	int index
)
Public Function GetNonContinuousRail (
	index As Integer
) As NonContinuousRailInfo
public:
NonContinuousRailInfo^ GetNonContinuousRail(
	int index
)
member GetNonContinuousRail :
        index : int -> NonContinuousRailInfo
Parameters
index Int32
 Non-Continuous Rail index.
Return Value
NonContinuousRailInfo
 The requested object handle.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index index is out of range.
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace